//********************************************************************************
//
// ShowTimer.hpp
//
// タイマーの表示
//
// Date: 2019/07/30 更新
//
//********************************************************************************

#pragma once

//================================================================================
// インクルード
//================================================================================
#include "../../GameManager/GameManager.h"
#include "../../ShareObject/FadeAni/FadeAni.hpp"
#include "../Ranking/Ranking.hpp"
#include "../Ranking/RankingTimeRender.hpp"

//================================================================================
// クラス定義
//================================================================================
class CShowTimer
{
public:

	//--------------------------------------------------------------------------------
	// コンストラクタ
	//--------------------------------------------------------------------------------
	CShowTimer();

	//--------------------------------------------------------------------------------
	// デストラクタ
	//--------------------------------------------------------------------------------
	~CShowTimer();

	//--------------------------------------------------------------------------------
	// ファイル読み込み
	// 引　数：CSystem*	システムクラスのポインタ
	//--------------------------------------------------------------------------------
	void LoadFile(CSystem* pSystem);

	//--------------------------------------------------------------------------------
	// 初期化
	// 引　数：CSystem*		システムクラスのポインタ
	// 　　　　const double	クリアタイム
	//--------------------------------------------------------------------------------
	void Initialize(CSystem* pSystem, const double clearTime);

	//--------------------------------------------------------------------------------
	// 更新
	// 引　数：CSystem*	システムクラスのポインタ
	//--------------------------------------------------------------------------------
	void Update(CSystem* pSystem, CFadeAni* pFade);

	//--------------------------------------------------------------------------------
	// 描画
	// 引　数：CSystem*	システムクラスのポインタ
	//--------------------------------------------------------------------------------
	void Draw(CSystem* pSystem);

	//--------------------------------------------------------------------------------
	// タイトルへ戻る
	// 戻り値：const bool	タイトルへ戻るならばTRUE
	//--------------------------------------------------------------------------------
	bool IsTitle() const { return m_isTitle; };

private:

	//--------------------------------------------------------------------------------
	// リザルトの初期化
	// 引　数：CSystem*	システムクラスのポインタ
	//--------------------------------------------------------------------------------
	void InitializeResultTexture(CSystem* pSystem);

	//--------------------------------------------------------------------------------
	// ランキング表示用クラスの初期化
	// 引　数：CSystem*	システムクラスのポインタ
	//--------------------------------------------------------------------------------
	void InitializeTimeRender(CSystem* pSystem);

	//--------------------------------------------------------------------------------
	// 自己タイム表示の初期化
	// 引　数：CSystem*		システムクラスのポインタ
	// 　　　　const double	クリアタイム
	//--------------------------------------------------------------------------------
	void InitializeMyTime(CSystem* pSystem, const double clearTime);

	//--------------------------------------------------------------------------------
	// ランキングタイム表示の初期化
	// 引　数：CSystem*		システムクラスのポインタ
	//--------------------------------------------------------------------------------
	void InitializeRankTime(CSystem* pSystem);

	enum SpriteTexture
	{
		ST_RESULT_BACK,
		ST_RESILT_LOGO,
		ST_HALF_LINE,
		ST_RESULT_TIME,
		ST_RESULT_RANK,
		ST_RESULT_NUM,
		ST_RESULT_GUIDE,
		ST_MAX,
	};

	enum TimeRender
	{
		TR_MY_TIME,
		TR_RANK1,
		TR_RANK2,
		TR_RANK3,
		TR_RANK4,
		TR_RANK5,
		TR_MAX,
	};

	CRanking* m_pRanking;
	CSpriteAnimation* m_pSprite[ST_MAX];
	CRankingTimeRender* m_pRender[TR_MAX];

	float m_halfWidth;
	float m_halfHeight;

	bool m_isTitle;
	bool m_isStart;
};