//*************************************************************
//
// コントローラーのキー設定
//
// Date: 2019/07/30 更新
//
//*************************************************************

#pragma once

//=============================================================
// インクルード
//=============================================================
namespace KeyConfig
{
	//=============================================================
	// デュアルショック4
	//=============================================================
	enum DS4Btn
	{
		SQUARE,
		CROSS,
		CIRCLE,
		TRIANGLE,
		L1,
		R1,
		L2,
		R2,
		SHARE,
		OPTION,
		LEFT_STICK,
		RIGHT_STICK,
		PS,
		TRACKPAD,
	};
	enum DS4Axis
	{
		LEFTHOR,
		LEFTVER,
		RIGHTHOR,
		RIGHTVER,
		R3,
		L3
	};

	enum Mouse
	{
		DIK_LBTN,
		DIK_RBTN,
		DIK_MBTN,
		DIK_WHEEL,
	};
}