//*************************************************************
//
// Window.h
//
// ウィンドウ管理
//
// ウィンドウ設定は(Resource/Data/Window/WindowSettings.txt)
//
// Date: 2019/10/31 更新
//
//*************************************************************

#pragma once

//=============================================================
// インクルード
//=============================================================
#include "../Common.h"

//=============================================================
// 構造体定義
//=============================================================
struct WindowSettings
{
	string Title;
	UINT Width;
	UINT Height;
	bool isWindowMode;
};

//=============================================================
// クラス定義
//=============================================================
class CWindowSystem
{
public:

	//-------------------------------------------------------------
	// コンストラクタ
	//-------------------------------------------------------------
	CWindowSystem();

	//-------------------------------------------------------------
	// デストラクタ
	//-------------------------------------------------------------
	~CWindowSystem();

	//-------------------------------------------------------------
	// 初期化
	// 引　数：HINSTANCE	インスタンスハンドル
	// 　　　　const int	アプリケーション初期表示方法
	//-------------------------------------------------------------
	void Initialize(HINSTANCE hInst, const int nShowCmd);

	//-------------------------------------------------------------
	// ウィンドウが処理されているか
	// 戻り値：BOOL 閉じられればFALSE
	//-------------------------------------------------------------
	bool IsLoop();

	//-------------------------------------------------------------
	// ウィンドウ設定の取得
	// 戻り値：WindowSettings	ウィンドウ設定
	//-------------------------------------------------------------
	WindowSettings GetWindowSettings() const;

	//-------------------------------------------------------------
	// ウィンドウハンドルの取得
	// 戻り値：HWND	ウィンドウハンドル
	//-------------------------------------------------------------
	HWND GetHWND() const;

	//-------------------------------------------------------------
	// インスタンスアプリケーションの取得
	//-------------------------------------------------------------
	HINSTANCE GetInstApp();

private:

	//-------------------------------------------------------------
	// ウィンドウ登録
	// 引　数：HINSTANCE	インスタンスハンドル
	// 　　　　const int	アプリケーション初期表示方法
	//-------------------------------------------------------------
	void WindowRegister(HINSTANCE hInst, const int nShowCmd);

	//-------------------------------------------------------------
	// ウィンドウ生成
	// 引　数：HINSTANCE	インスタンスハンドル
	// 　　　　const int	アプリケーション初期表示方法
	//-------------------------------------------------------------
	void WindowCreate(HINSTANCE hInst, const int nShowCmd);

	//-------------------------------------------------------------
	// ウィンドウプロシージャ
	// 引　数：HWND			ウィンドウハンドル
	// 　　　　UINT			メッセージ
	// 　　　　WPARAM		パラメータ
	// 　　　　LPARAM		パラメータ
	//-------------------------------------------------------------
	static LRESULT __stdcall WindowProc(
		HWND hWnd, UINT uMsg, WPARAM wParam, LPARAM lParam);

	//-------------------------------------------------------------
	// パラメータの読み込み
	//-------------------------------------------------------------
	void LoadFile();

	//-------------------------------------------------------------
	// パラメータの読み込みができなかったとき用(初期化)
	//-------------------------------------------------------------
	void InitFile();

	WindowSettings m_windowSettings;
	string m_strClassName;
	HINSTANCE m_hInstance;
	HWND m_hWnd;
	MSG  m_msg;

	//コピー防止
	CWindowSystem& operator=(const CWindowSystem&);
	CWindowSystem(const CWindowSystem&);
};