//*************************************************************
//
// XFrame.hpp
//
// XFileメッシュ描画用クラス
//
// Date: 2019/07/30 更新
//
//*************************************************************

#pragma once

//=============================================================
// インクルード
//=============================================================
#include "../../../../Common.h"
#include "AllocateHierarchey.h"

//=============================================================
// クラス定義
//=============================================================
class CXFrame
{
public:
	//-------------------------------------------------------------
	// コンストラクタ
	//-------------------------------------------------------------
	CXFrame();

	//-------------------------------------------------------------
	// メッシュコンテナの描画
	//-------------------------------------------------------------
	void DrawMeshContainer(LPDIRECT3DDEVICE9 pDevice, LPD3DXMESHCONTAINER pMeshContainerBase, LPD3DXFRAME pFrameBase, LPD3DXMATRIX pMatWorld, float meshAlpha);

	//-------------------------------------------------------------
	// フレームの描画
	//-------------------------------------------------------------
	void DrawFrame(LPDIRECT3DDEVICE9 pDevice, LPD3DXFRAME pFrame, LPD3DXMATRIX pMatWorld, float meshAlpha);

	//-------------------------------------------------------------
	// ボーンマトリックスのメッシュ
	//-------------------------------------------------------------
	HRESULT SetupBoneMatrixPointersOnMesh(LPD3DXMESHCONTAINER pMeshContainerBase);

	//-------------------------------------------------------------
	// ボーンマトリックス
	//-------------------------------------------------------------
	HRESULT SetupBoneMatrixPointers(LPD3DXFRAME pFrame);

	//-------------------------------------------------------------
	// フレーム行列の更新
	//-------------------------------------------------------------
	void UpdateFrameMatrices(LPD3DXFRAME pFrameBase, LPD3DXMATRIX pParentMatrix);

	//-------------------------------------------------------------
	// ボーンのマトリックス行列取得
	//-------------------------------------------------------------
	Matrix GetBoneMatrix(string strBoneName, Matrix* pMatWorld);

	//-------------------------------------------------------------
	// フレームの取得
	//-------------------------------------------------------------
	LPD3DXFRAME* GetFrame();

	//-------------------------------------------------------------
	// フレーム名からフレームを取得
	// 戻り値：フレームのアドレス
	// 引　数：LPCSTR フレーム名
	//-------------------------------------------------------------
	LPD3DXFRAME GetFrameName(LPCSTR framename);

	//-------------------------------------------------------------
	// ルートフレーム内のメッシュへのポインタを取得
	// 戻り値：ルートフレーム内のメッシュへのポインタ
	//-------------------------------------------------------------
	LPD3DXMESH GetRootMesh() const;

protected:

	//ルートフレーム
	LPD3DXFRAME m_pFrameRoot;

	//コピー防止
	CXFrame& operator=(const CXFrame&);
	CXFrame(const CXFrame&);
};