//*************************************************************
//
// Obb.h
//
// 当たり判定クラス(箱)
//
// Date: 2019/07/30 更新
//
//*************************************************************

#pragma once

//=============================================================
// インクルード
//=============================================================
#include "../Common.h"
#include "../System/System.h"

//=============================================================
// 構造体定義
//=============================================================
struct ObbData
{
	Vector3 vecRad;
	Vector3 vecPos;
	Vector3 vecAdjust;
	Vector3 vecAxisX;
	Vector3 vecAxisY;
	Vector3 vecAxisZ;
};

//=============================================================
// クラス定義
//=============================================================
class CBoundingBox
{
public:

	//-------------------------------------------------------------
	// コンストラクタ
	//-------------------------------------------------------------
	CBoundingBox();

	//-------------------------------------------------------------
	// デストラクタ
	//-------------------------------------------------------------
	~CBoundingBox();

	//-------------------------------------------------------------
	// 初期化
	// 引　数：CSystem* pSystem		システムクラスのポインタ
	// 　　　　const Vector3*		最大値
	// 　　　　const Vector3*		最小値
	// 　　　　const bool			デバッグ用描画
	//-------------------------------------------------------------
	void Create(CSystem* pSystem, const Vector3* pVecMax, const Vector3* pVecMin, const bool showDebug);

	//-------------------------------------------------------------
	// 描画
	// 引　数：CSystem* pSystem		システムクラスのポインタ
	//-------------------------------------------------------------
	void Draw(CSystem* pSystem);

	//-------------------------------------------------------------
	// 世界行列の設定
	// 引　数：const Matrix*		世界行列
	//-------------------------------------------------------------
	void SetTransform(const Matrix* pMatWorld);

	//-------------------------------------------------------------
	// 世界行列の取得
	// 戻り値：const float			世界行列
	//-------------------------------------------------------------
	Matrix GetTransform() const;

	//-------------------------------------------------------------
	// 最大値
	//-------------------------------------------------------------
	Vector3 GetMaxVector3();

	//-------------------------------------------------------------
	// 最小値
	//-------------------------------------------------------------
	Vector3 GetMinVector3();

	//-------------------------------------------------------------
	// バウンディングボックスのデータ
	// 戻り値：const ObbData	ObbData構造体
	//-------------------------------------------------------------
	ObbData* GetObb();

private:
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuf;
	LPDIRECT3DINDEXBUFFER9  m_pIdxBuf;
	Vector3 m_vecMax;
	Vector3 m_vecMin;
	Matrix m_matWorld;
	ObbData m_obbData;
	static const int POLYGON_NUM;
	static const int VERTEX_NUM;
	static const int INDEX_NUM;
};