//*************************************************************
//
// DebugText.h
//
// Debug用クラス
//
// Date: 2019/07/30 更新
//
//*************************************************************

#pragma once

//=============================================================
// インクルード
//=============================================================
#include "../Common.h"

//=============================================================
// クラス定義
//=============================================================
class CDebugText
{
public:
	//-------------------------------------------------------------
	// 新しいウィンドウの生成
	//-------------------------------------------------------------
	static bool NewWindowStart(string);
	static void NewWindowEnd();

	//-------------------------------------------------------------
	// ツリー構造
	//-------------------------------------------------------------
	static bool TreeStart(string);
	static void TreeEnd();

	//-------------------------------------------------------------
	// システムデバッグ用
	//-------------------------------------------------------------
	static void DebugInfo(string);

	//-------------------------------------------------------------
	// スライダー数値
	//-------------------------------------------------------------
	static void SliderValue(string, Vector2*, float, float);
	static void SliderValue(string, Vector3*, float, float);
	static void SliderValue(string, Vector4*, float, float);

	//-------------------------------------------------------------
	// 入力数値
	//-------------------------------------------------------------
	static void InputValue(string, Vector2*);
	static void InputValue(string, Vector3*);
	static void InputValue(string, Vector4*);

	//-------------------------------------------------------------
	// ドラッグ数値
	//-------------------------------------------------------------
	static void DragValue(string, Vector2*);
	static void DragValue(string, Vector3*);
	static void DragValue(string, Vector4*);
};