//*************************************************************
//
// IntervalTimer.h
//
// 間隔管理クラス
//
// Date: 2019/07/30 更新
//
//*************************************************************

//=============================================================
// インクルード
//=============================================================
#include "IntervalTimer.h"

//-------------------------------------------------------------
// コンストラクタ
//-------------------------------------------------------------
CIntervalTimer::CIntervalTimer()
	: m_limiter(0.0)
	, m_elapsedTime(0.0)
{
}

//-------------------------------------------------------------
// タイマーの設定
// 引　数：double	繰り返す間隔の制限時間
//-------------------------------------------------------------
void CIntervalTimer::SetTimer(double limit)
{
	m_limiter = limit;
}

//-------------------------------------------------------------
// 過ぎたときのタイミング
// 引　数：double	毎フレームの経過時間
//-------------------------------------------------------------
bool CIntervalTimer::IsTimeOut(double dt)
{
	m_elapsedTime += dt;
	if (m_elapsedTime >= m_limiter)
	{
		m_elapsedTime = 0.0;
		return true;
	}

	return false;
}
