//*************************************************************
//
// シャドウマップレンダリング
//
// ShadowMap.cpp
//
// Cascaded Shadow Maps
//
//*************************************************************

//=============================================================
// インクルード
//=============================================================
#include "ShadowMap.h"

//-------------------------------------------------------------
// コンストラクタ
//-------------------------------------------------------------
CShadowMap::CShadowMap()
{
}

//-------------------------------------------------------------
// デストラクタ
//-------------------------------------------------------------
CShadowMap::~CShadowMap()
{
}

//-------------------------------------------------------------
// 初期化
// 引　数：LPDIRECT3DDEVICE9 デバイスのポインタ
//-------------------------------------------------------------
void CShadowMap::Initialize(LPDIRECT3DDEVICE9 pDevice)
{
	CShaderBase::Initialize(pDevice, "Resource/Shaders/shadow_map.fx");
}

//-------------------------------------------------------------
// 更新
// 引　数：Engine*	エンジンクラスのポインタ
//-------------------------------------------------------------
void CShadowMap::Update() {}

//-------------------------------------------------------------
// シャドウテクスチャの設定
// 引　数：LPDIRECT3DTEXTURE9	テクスチャデータのポインタ
//-------------------------------------------------------------
void CShadowMap::SetShadowTexture0(LPDIRECT3DTEXTURE9 pTexture)
{
	CShaderBase::SetValue("ShadowTexture0", pTexture);
}

//-------------------------------------------------------------
// シャドウテクスチャの設定
// 引　数：LPDIRECT3DTEXTURE9	テクスチャデータのポインタ
//-------------------------------------------------------------
void CShadowMap::SetShadowTexture1(LPDIRECT3DTEXTURE9 pTexture)
{
	CShaderBase::SetValue("ShadowTexture1", pTexture);
}

//-------------------------------------------------------------
// シャドウテクスチャの設定
// 引　数：LPDIRECT3DTEXTURE9	テクスチャデータのポインタ
//-------------------------------------------------------------
void CShadowMap::SetShadowTexture2(LPDIRECT3DTEXTURE9 pTexture)
{
	CShaderBase::SetValue("ShadowTexture2", pTexture);
}
