//*************************************************************
//
// DX9_GameLib
//
// アプリケーション初期エントリ
// 
// Version: 1.2.0
// 
// Date: 2019/10/31 更新
//
// DX9 -> DX11 へのアップグレードをするためにファイル構成等変更
//
//*************************************************************

//=============================================================
// インクルード
//=============================================================
#include "Application/Application.h"

//=============================================================
// メイン関数
//=============================================================
INT WINAPI WinMain(HINSTANCE hInst, HINSTANCE, LPSTR, int nCmd)
{
	//メモリリーク発見
	_CrtSetDbgFlag(_CRTDBG_LEAK_CHECK_DF | _CRTDBG_ALLOC_MEM_DF);

	CApplication App;
	App.Initialize(hInst, nCmd);
	App.MainLoop();
	App.ShutDown();

	return 0;
}