//********************************************************************************
//
// BaseObject.hpp
//
// ミニマップクラス
//
// Date: 2019/07/30 更新
//
//********************************************************************************

#pragma once

//================================================================================
// インクルード
//================================================================================
#include "../../../GameManager/GameManager.h"
#include "../../AI/AIManager.hpp"
#include "../../Player/Player.hpp"
#include "../../Camera/PlayerCamera.hpp"

//================================================================================
// クラス定義
//================================================================================
class CMinimap
{
public:

	//--------------------------------------------------------------------------------
	// コンストラクタ
	//--------------------------------------------------------------------------------
	CMinimap();

	//--------------------------------------------------------------------------------
	// デストラクタ
	//--------------------------------------------------------------------------------
	~CMinimap();

	//--------------------------------------------------------------------------------
	// ファイル読み込み
	// 引　数：CSystem*	システムクラスのポインタ
	//--------------------------------------------------------------------------------
	void LoadFile(CSystem* pSystem);

	//--------------------------------------------------------------------------------
	// 初期化
	// 引　数：CSystem*	システムクラスのポインタ
	//--------------------------------------------------------------------------------
	void Initialize(CSystem* pSystem);

	//--------------------------------------------------------------------------------
	// 描画
	// 引　数：CSystem*			システムクラスのポインタ
	// 　　　　CPlayerCamera*	カメラクラスのポインタ
	// 　　　　CPlayer*			プレイヤークラスのポインタ
	// 　　　　CAIManager*		敵管理クラスのポインタ
	//--------------------------------------------------------------------------------
	void Draw(CSystem* pSystem, CPlayerCamera* pCamera, CPlayer* pPlayer, CAIManager* pAi);

private:


	//--------------------------------------------------------------------------------
	// ポジションの描画 (Enemy)
	// 引　数：CSystem*　	３Ｄエンジンクラスへのポインタ
	//		 　Vector3*		位置ベクトルポインタ
	// 　　　　float		回転角度
	// 　　　　bool			デフォルトTRUE -> ボスならばFALSE
	//--------------------------------------------------------------------------------
	void DrawPosition(CSystem *pSystem, Vector3 *pVecPos, float fAngle, bool bEnemy = true);

	//--------------------------------------------------------------------------------
	// 圧縮ポジション
	// 引　数：Vector3*　		位置ベクトルのポインタ
	//		 ：Vector3			位置ベクトル
	//		 ：float			回転
	//		 ：float			距離
	//--------------------------------------------------------------------------------
	void CompressAnglePosition(Vector3 *pVecPos, Vector3 vecPos, float fAngle, float fDistance);

	enum SpriteAnimation
	{
		MINIMAP_BACK,
		MAX,
	};

	CSpriteAnimation* m_pSprite[MAX];

	float m_minimapCenterX;
	float m_minimapCenterY;
};