//********************************************************************************
//
// TitleManager.hpp
//
// タイトルレンダリング
//
// Date: 2019/07/30 更新
//
//********************************************************************************

//================================================================================
// インクルード
//================================================================================
#include "Title.hpp"

using namespace FileConst;

//================================================================================
// クラス定義
//================================================================================

//--------------------------------------------------------------------------------
// コンストラクタ
//--------------------------------------------------------------------------------
CTitleManager::CTitleManager()
	: m_pStart(new CStartSelect)
	, m_isStart(false)
	, m_isExit(false)

{
}

//--------------------------------------------------------------------------------
// デストラクタ
//--------------------------------------------------------------------------------
CTitleManager::~CTitleManager()
{
	SafeDelete(m_pStart);
}

//--------------------------------------------------------------------------------
// ファイル読み込み
// 引　数：CSystem*	システムクラスのポインタ
//--------------------------------------------------------------------------------
void CTitleManager::LoadFile(CSystem * pSystem)
{
	pSystem->AddBgm(BGM_TITLE,	"Resource/Sounds/Bgm/bgm_title.wav");
	pSystem->AddSe(SE_SELECT,	"Resource/Sounds/Se/se_select.wav");
	pSystem->AddSe(SE_ENTER,	"Resource/Sounds/Se/se_next.wav");
	m_pStart->LoadFile(pSystem);
}

//--------------------------------------------------------------------------------
// 初期化
// 引　数：CSystem*	システムクラスのポインタ
//--------------------------------------------------------------------------------
void CTitleManager::Initialize(CSystem * pSystem)
{
	pSystem->PlayBgm(BGM_TITLE);

	m_pStart->Initialize(pSystem);
}

//--------------------------------------------------------------------------------
// 更新
// 引　数：CSystem*	システムクラスのポインタ
//--------------------------------------------------------------------------------
void CTitleManager::Update(CSystem * pSystem)
{
	m_pStart->Update(pSystem);
}

//--------------------------------------------------------------------------------
// 描画
// 引　数：CSystem*	システムクラスのポインタ
//--------------------------------------------------------------------------------
void CTitleManager::Draw(CSystem * pSystem)
{
	m_pStart->Draw(pSystem);
}

//--------------------------------------------------------------------------------
// ゲームシーンへ飛ぶ
// 引　数：CFadeAni*	フェードクラスのポインタ
//--------------------------------------------------------------------------------
bool CTitleManager::IsGame(CFadeAni* pFade)
{
	if (m_pStart->GetSelected() == CStartSelect::SS_START)
	{
		pFade->SetFadeMode(F_IN);
		m_isStart = true;
	}

	if (pFade->IsFadeEnd() && m_isStart)
	{
		return true;
	}

	return false;
}

//--------------------------------------------------------------------------------
// 終了する
// 引　数：CFadeAni*	フェードクラスのポインタ
//--------------------------------------------------------------------------------
bool CTitleManager::IsExit(CFadeAni * pFade)
{
	if (m_pStart->GetSelected() == CStartSelect::SS_EXIT)
	{
		pFade->SetFadeMode(F_IN);
		m_isExit = true;
	}

	if (pFade->IsFadeEnd() && m_isExit)
	{
		return true;
	}
	return false;
}