//*************************************************************
//
// ShareObject.h
//
// シーン間でやりとりするオブジェクト
//
// Date: 2019/07/30 更新
//
//*************************************************************

#pragma once

//=============================================================
// インクルード
//=============================================================
#include "../../Library/Common.h"

#include "DemoRender/DemoRender.hpp"
#include "FadeAni/FadeAni.hpp"

//=============================================================
// 構造体定義
//=============================================================
struct ShareObject
{
	double clearTime;
	CDemoRender render;
	CFadeAni fadeAni;
};