//*************************************************************
//
// DirectionLight.hpp
//
// 方向ライトクラス
//
// Date: 2019/07/30 更新
//
//*************************************************************

#pragma once

//=============================================================
// インクルード
//=============================================================
#include "../../Common.h"

//=============================================================
// クラス定義
//=============================================================
class CDirectionLight
{
public:
	//-------------------------------------------------------------
	// コンストラクタ
	//-------------------------------------------------------------
	CDirectionLight();

	//-------------------------------------------------------------
	// ライト位置設定
	// 引　数：const Vector3	位置の設定
	//-------------------------------------------------------------
	void SetPosition(const Vector3 vecPos);

	//-------------------------------------------------------------
	// ライト方向の設定
	// 引　数：const Vector3	ライトの方向
	//-------------------------------------------------------------
	void SetDirection(const Vector3 vecDir);

	//-------------------------------------------------------------
	// ライト位置の取得
	// 戻り値：const Vector3	位置の設定
	//-------------------------------------------------------------
	void SetProjection();

	//-------------------------------------------------------------
	// ライト位置の取得
	// 戻り値：const Vector3	位置の設定
	//-------------------------------------------------------------
	void SetOrtho();

	//-------------------------------------------------------------
	// ライト位置の取得
	// 戻り値：const Vector3	位置の設定
	//-------------------------------------------------------------
	Vector3 GetPosition() const;

	//-------------------------------------------------------------
	// ライト方向の取得
	// 戻り値：const Vector3	ライトの方向
	//-------------------------------------------------------------
	Vector3 GetDirection() const;

	//-------------------------------------------------------------
	// シャドウ調整用行列の取得
	// 戻り値：D3DXMATRIX	ライト調整用
	//-------------------------------------------------------------
	Matrix GetLightBias() const;

	//-------------------------------------------------------------
	// シャドウ用ビュー行列の取得
	// 戻り値：D3DXMATRIX	ライト調整用
	//-------------------------------------------------------------
	Matrix GetViewMatrix() const;

	//-------------------------------------------------------------
	// シャドウ用プロジェクション行列の取得
	// 戻り値：D3DXMATRIX	ライト調整用
	//-------------------------------------------------------------
	Matrix GetProjectionMatrix() const;

private:

	Vector3 m_vecLookAt;
	Vector3 m_vecUp;
	Vector3 m_vecPos;
	Vector3 m_vecDir;

	Vector4 m_diffuse;
	Vector4 m_ambient;
	Vector4 m_specular;

	Matrix m_matView;
	Matrix m_matProj;
	Matrix m_matBias;

	//コピー防止
	CDirectionLight& operator=(const CDirectionLight&);
	CDirectionLight(const CDirectionLight&);
};